Autodesk.Revit.DB.OpenConflictResult
Since:
2019
The result of the open conflict.
Since:
2019

Autodesk.Revit.DB.OpenConflictResult.Cancel
Cancel the open action.

Autodesk.Revit.DB.OpenConflictResult.DiscardLocalChangesAndOpenLatestVersion
Discard the local changes and open the latest version of the model.

Autodesk.Revit.DB.OpenConflictResult.KeepLocalChanges
Keeps the local changes and open the model.